src/cf/DataProcessors/ТестированиеПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ТестированиеПодключаемогоОборудования</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстройствоРаспознавания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблачнаяККТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Несертифицируемое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПодключаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УстройствоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключенияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипыПодключаемогоОборудования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДрайверОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрайверыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФорматноЛогическогоКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеРасхождениеФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПереустановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУстановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическаяФискализация</Name>
					<Comment>Автоматическая фискализация чеков из очереди чеков</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяФН36</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыводитьОтраслевыеРеквизиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОграничениеДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПользовательБПО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРегистрации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/ТестированиеПодключаемогоОборудования/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ДополнительныеПараметры;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	РабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
	ПолучитьОборудованиеРМНаСервере();
	ТекущийПЛУ = 1;
	
	ШтрихкодEAN8 = "46120441";
	ШтрихкодEAN13 = "2900001462105";
	ШтрихкодCODE39 = "2PMP-468-PJM";
	ШтрихкодQR = "http://www.1c.ru";    
	ПИоТ_КонтрольнаяМарка = "MDQ2MDYyMDMxMDIyMjgheDttQT1rQUNhVWFqbmo=";
	
	ПечатьШтрихкодаEAN8 = Истина;
	ПечатьШтрихкодаEAN13 = Истина;
	ПечатьШтрихкодаCODE39 = Истина;
	ПечатьШтрихкодаQR = Истина;
	
	Отправляет1СEmail = Ложь;
	Отправляет1СSMS   = Ложь;
	ККТ_Электронно    = Ложь;  
	
	НефискальнаяКвитанция = Ложь;
	ОбновлениеДисплея  = Истина;  
	ГотовностьКРаботе  = Истина;    
	НаличнаяОплата = Ложь;    
	ПроверятьОСУ = Ложь; 
	
	ЭТСумма  = 10.12;
	СуммаИнкассации = 10.12;
	
	Если Не ОбщегоНазначенияБПО.ИспользуетсяПринтерыЭтикеток() Тогда
		Элементы.ГруппаПЭ.Видимость = Ложь;
		Элементы.РаботаСПЭ.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияБПО.ИспользуетсяСчитывательRFID() Тогда
		Элементы.ГруппаRFID.Видимость = Ложь;
		Элементы.РаботаRFID.Видимость = Ложь;
	КонецЕсли;
	
	ДП_КоличествоКнопок = 5;
	
#Если ВебКлиент Тогда
	Элементы.ПечатьПакетно.Видимость = Ложь;
#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" Тогда
		// Отладочное
		Лог = "Получено внешнее событие
		      |Источник = " + Источник + "
		      |Событие = "  + ИмяСобытия;
		ОбновитьОтображениеДанных();
		
		Если ИмяСобытия = "Weighting" Тогда    
			
			ТекстСообщения = СтрШаблон("Вес %1 (%2) %3", 
				Параметр.Вес, 
				?(Параметр.Стабилизация, "Стабилен", "Нестабилен"),
				?(Параметр.ОшибкаРазмещения, "Ошибка размещения", ""));
			Если Параметр.ОшибкаРазмещения Тогда
				Для Каждого ЗонаПересечения Из Параметр.ЗонаПересечения Цикл
					ТекстСообщения = ТекстСообщения + "," + ЗонаПересечения;
				КонецЦикла;
			КонецЕсли;
			Сообщить(ТекстСообщения);
		
		ИначеЕсли ИмяСобытия = "ScanData" Тогда
			
			ПолученШтрихкод(Параметр[0]);
			
		ИначеЕсли ИмяСобытия = "Pressed" Тогда
			
			Сообщить(Параметр);
			
		ИначеЕсли ИмяСобытия = "ScanDataBase64" Тогда
			
			ПолученШтрихкод(Параметр[0], Истина);
			
		ИначеЕсли ИмяСобытия = "TracksData" Тогда
			
			Если Параметр[1] = Неопределено Тогда
				ПолученКодКарты(Параметр[0], Параметр[0]);
			Иначе
				ПолученКодКарты(Параметр[0], Параметр[1][1]);
			КонецЕсли;
			
		ИначеЕсли ИмяСобытия = "RFID" Тогда
			
			Для Каждого Элемент Из Параметр Цикл
				МеткаRFID = МеткиRFID.Добавить();
				ЗаполнитьЗначенияСвойств(МеткаRFID, Элемент);
			КонецЦикла;
				
		КонецЕсли;
	КонецЕсли;     
	
КонецПроцедуры

&НаКлиенте
Функция ПолученШтрихкод(Штрихкод, ШтрихкодВBase64 = Ложь)
	
	ЭТРеквизитыКартыQR = НСтр("ru='Штрихкод не является Consumer-Presented QR.'");
	
	МаркировкаGTIN = "";
	МаркировкаEAN = "";
	МаркировкаСерийныйНомер = "";
	МаркировкаКодПроверки = "";
	
	Лог = Формат(ОбщегоНазначенияБПОКлиент.ДатаСеанса(),"ДЛФ=T") + " Имя команды: ПолученШтрихкод" + Символы.ПС;
	ОтветОтУстройства = Лог + ОтветОтУстройства;
	
	Если ШтрихкодВBase64 Тогда
		ШтрихкодBase64 = Штрихкод;
		ДанныеСканера = МенеджерОборудованияКлиентСервер.Base64ВШтрихкод(Штрихкод);
	Иначе
		ШтрихкодBase64 = МенеджерОборудованияКлиентСервер.ШтрихкодВBase64(Штрихкод);
		ДанныеСканера = Штрихкод; 
	КонецЕсли;
	
	ТипШтрихкода  = МенеджерОборудованияКлиентСервер.ОпределитьТипШтрихкода(ДанныеСканера);
	
	ОбновитьОтображениеДанных();
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПолученКодКарты(КодКарты, ДанныеДорожек)

	// Пишем лог
	Лог = Формат(ОбщегоНазначенияБПОКлиент.ДатаСеанса(), "ДЛФ=T") + " Имя команды: ПолученКодКарты" + Символы.ПС;
	Лог = Лог + "Код карты: " + КодКарты + Символы.ПС;
	Если ТипЗнч(ДанныеДорожек) = Тип("Массив") Тогда
		Для НомерДорожки = 1 По ДанныеДорожек.Количество() Цикл
			НоваяСтрока = ТаблицаЗагрузкиИзТСД.Добавить();
			Лог = Лог + "ДанныеДорожки(" + НомерДорожки + "): " + ДанныеДорожек[НомерДорожки - 1] + Символы.ПС;
		КонецЦикла;
		// Выводим считанные данные
		Дорожка1 = ?(ДанныеДорожек.Количество() > 0, ДанныеДорожек[0], "");
		Дорожка2 = ?(ДанныеДорожек.Количество() > 1, ДанныеДорожек[1], "");
		Дорожка3 = ?(ДанныеДорожек.Количество() > 2, ДанныеДорожек[2], "");
		
	ИначеЕсли ТипЗнч(ДанныеДорожек) = Тип("Строка") Тогда
		Дорожка1 = ДанныеДорожек;
		Лог = Лог + "ДанныеДорожек: " + ДанныеДорожек + Символы.ПС;
	КонецЕсли;
	
	Лог = Лог + "========================================" + Символы.ПС;
	ОтветОтУстройства = Лог + ОтветОтУстройства;
	
	ОбновитьОтображениеДанных();

	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура ДанныеСканераПриИзменении(Элемент)
	
	ТипШтрихкода  = МенеджерОборудованияКлиентСервер.ОпределитьТипШтрихкода(ДанныеСканера);
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДополнительныеПараметры = МенеджерОборудованияКлиентСервер.ДополнительныеПараметрыОперации(Истина);
	ПО_ОставлятьПодключенными = ДополнительныеПараметры.ОставитьПодключенным; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	МенеджерОборудованияКлиент.НачатьОтключениеВсегоОборудования();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииНаСервере

&НаСервере
Процедура ПолучитьОборудованиеРМНаСервере()

	Отбор = Новый Структура("РабочееМесто", РабочееМесто);
	ОборудованиеРМ = Справочники.ПодключаемоеОборудование.Выбрать(,, Отбор);
	Пока ОборудованиеРМ.Следующий() Цикл
		Если НЕ ОборудованиеРМ.УстройствоИспользуется Или ОборудованиеРМ.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		_ТипОборудования = ОборудованиеРМ.ТипОборудования;
		Если _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода Тогда
			СканерШК = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
			ККТ = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных Тогда
			ТСД = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ДисплейПокупателя Тогда
			Дисплей = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательМагнитныхКарт Тогда
			СчитывательМК = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательRFID Тогда
			СчитывательRFID = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭлектронныеВесы Тогда
			Весы = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал Тогда
			ЭТ = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток Тогда
			ВесыСПечатьюЭтикеток = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков Тогда
			ПринтерЧеков = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПринтерЭтикеток Тогда
			ПринтерЭтикеток = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ОблачнаяККТ Тогда
			ОблачнаяККТ = ОборудованиеРМ.Ссылка;
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОчиститьКэш()
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокиМакетаСлипЧека()
   
  Возврат Обработки.ТестированиеПодключаемогоОборудования.ПолучитьМакет("МакетЧеков").ПолучитьТекст();

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьТекущееТО(ИмяТипа)  
	
	Если ИмяТипа = "ККТ" Тогда
		Оборудование = ККТ;
	ИначеЕсли ИмяТипа = "ТСД" Тогда
		Оборудование = ТСД;
	ИначеЕсли ИмяТипа = "Дисплей" Тогда
		Оборудование = Дисплей;
	ИначеЕсли ИмяТипа = "Весы" Тогда
		Оборудование = Весы;
	ИначеЕсли ИмяТипа = "ЭТ" Тогда
		Оборудование = ЭТ;
	ИначеЕсли ИмяТипа = "Сканер" Тогда
		Оборудование = СканерШК;
	ИначеЕсли ИмяТипа = "RFID" Тогда
		Оборудование = СчитывательRFID;
	ИначеЕсли ИмяТипа = "СМК" Тогда
		Оборудование = СчитывательМК;
	ИначеЕсли ИмяТипа = "ВесыСПечатьюЭтикеток" Тогда
		Оборудование = ВесыСПечатьюЭтикеток;
	ИначеЕсли ИмяТипа = "ПринтерЧеков" Тогда
		Оборудование = ПринтерЧеков;
	ИначеЕсли ИмяТипа = "ПЭ" Тогда
		Оборудование = ПринтерЭтикеток;
	ИначеЕсли ИмяТипа = "ОК" Тогда
		Оборудование = ОблачнаяККТ;
	ИначеЕсли ИмяТипа = "Несертифицированное" Тогда
		Оборудование = НесертифицированноеОборудование;
		
	КонецЕсли;   
	
	Возврат Оборудование;     
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура РабочееМестоПриИзменении(Элемент)

	// Заполняем оборудование рабочего места.
	ПолучитьОборудованиеРМНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьУстройствоВыполнить_Завершение(РезультатВыполнения, Параметры) Экспорт
	
	// Пишем лог
	Лог = Формат(ОбщегоНазначенияБПОКлиент.ДатаСеанса(),"ДЛФ=T") + " Имя команды: Подключить - Завершение" + Символы.ПС;
	ОписаниеОшибки = ?(РезультатВыполнения.Результат, "Команда выполнена успешно!", РезультатВыполнения.ОписаниеОшибки);
	
	// Пишем лог
	Лог = Лог + Формат(ОбщегоНазначенияБПОКлиент.ДатаСеанса(),"ДЛФ=T") + " " + ОписаниеОшибки + Символы.ПС +
	      "========================================" + Символы.ПС;
	ОтветОтУстройства = Лог + ОтветОтУстройства;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьУстройствоВыполнить(Команда)

	// Получаем имя типу оборудования.
	ИмяТипа = СтрЗаменить(ТекущийЭлемент.Имя, "Подключить", "");
	// Получаем оборудование по типу.
	Оборудование = ПолучитьТекущееТО(ИмяТипа);
	Если Оборудование.Пустая() Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьУстройствоВыполнить_Завершение", ЭтотОбъект);                                 
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоИдентификатору(ОповещенияПриПодключении, УникальныйИдентификатор, Оборудование);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьУстройствоВыполнить_Завершение(РезультатВыполнения, Параметры) Экспорт
	
	// Пишем лог
	Лог = Формат(ОбщегоНазначенияБПОКлиент.ДатаСеанса(),"ДЛФ=T") + " Имя команды: Отключить - Завершение" + Символы.ПС;
	ОписаниеОшибки = ?(РезультатВыполнения.Результат, "Команда выполнена успешно!", РезультатВыполнения.ОписаниеОшибки);
	
	Лог = Лог + Формат(ОбщегоНазначенияБПОКлиент.ДатаСеанса(),"ДЛФ=T") + " " + ОписаниеОшибки + Символы.ПС +
	      "========================================" + Символы.ПС;
	ОтветОтУстройства = Лог + ОтветОтУстройства;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьУстройствоВыполнить(Команда)
	
	// Получаем имя типу оборудования.
	ИмяТипа = СтрЗаменить(ТекущийЭлемент.Имя,"Отключить","");
	// Получаем оборудование по типу.
	Оборудование = ПолучитьТекущееТО(ИмяТипа);
	Если Оборудование.Пустая() Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОповещенияПриПодключении = Новый ОписаниеОповещения("ОтключитьУстройствоВыполнить_Завершение", ЭтотОбъект);                                 
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоИдентификатору(ОповещенияПриПодключении, УникальныйИдентификатор, Оборудование);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьУстройствоВыполнить(Команда)
	
	// Получаем имя типу оборудования.
	ИмяТипа = СтрЗаменить(ТекущийЭлемент.Имя,"Настроить","");
	// Получаем оборудование по типу.
	Оборудование = ПолучитьТекущееТО(ИмяТипа);
	Если Оборудование.Пустая() Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ИмяТипа = "ОК" Тогда
		МодульОблачныеКассы = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОблачныеКассыКлиент");
		МодульОблачныеКассы.НастройкаПодключения(Оборудование);
	Иначе
		МенеджерОборудованияКлиент.ВыполнитьНастройкуОборудования(Оборудование);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКэшВыполнить()
	
	ОчиститьКэш();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьВсеПодключенноеОборудованиеВыполнить()
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудования(Неопределено, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормыRFID

&НаКлиенте
Процедура RFID_ОперацияЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(НСтр("ru='Операция выполнена успешно:'") + РезультатВыполнения.ИдентификаторУстройства);
	Иначе
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(РезультатВыполнения.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура RFID_ОткрытьСессию(Команда)
	
	Если Не ЗначениеЗаполнено(СчитывательRFID) Тогда
		ТекстСообщения = НСтр("ru='Не выбран считыватель RFID.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("RFID_ОперацияЗавершение", ЭтотОбъект);
	МодульОборудованиеСчитывательRFIDКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеСчитывательRFIDКлиент");
	МодульОборудованиеСчитывательRFIDКлиент.НачатьОткрытиеСессииСчитывателяRFID(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, СчитывательRFID);
	
КонецПроцедуры

&НаКлиенте
Процедура RFID_ЗакрытьСессию(Команда)
	
	Если Не ЗначениеЗаполнено(СчитывательRFID) Тогда
		ТекстСообщения = НСтр("ru='Не выбран считыватель RFID.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("RFID_ОперацияЗавершение", ЭтотОбъект);
	МодульОборудованиеСчитывательRFIDКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеСчитывательRFIDКлиент");
	МодульОборудованиеСчитывательRFIDКлиент.НачатьЗакрытиеСессииСчитывателяRFID(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, СчитывательRFID);

КонецПроцедуры

&НаКлиенте
Процедура RFID_ЗаписатьВМеткуEPC(Команда)
	
	Если Не ЗначениеЗаполнено(СчитывательRFID) Тогда
		ТекстСообщения = НСтр("ru='Не выбран считыватель RFID.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ТекущаяСрока = Элементы.МеткиRFID.ТекущиеДанные;
	Если ТекущаяСрока <> Неопределено Тогда
		МодульОборудованиеСчитывательRFIDКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеСчитывательRFIDКлиент");
		ПараметрыЗаписи = МодульОборудованиеСчитывательRFIDКлиент.ПараметрыЗаписиМеткиRFID();
		ПараметрыЗаписи.TID = ТекущаяСрока.TID;
		ПараметрыЗаписи.EPC = ТекущаяСрока.EPC;
		ПараметрыЗаписи.БанкПамяти = "EPC";
		ПараметрыЗаписи.Данные = МенеджерОборудованияКлиентСервер.СформироватьДанныеSGTIN96(ТекущаяСрока.GTIN, ТекущаяСрока.СерийныйНомер);
		ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("RFID_ОперацияЗавершение", ЭтотОбъект);
		МодульОборудованиеСчитывательRFIDКлиент.НачатьЗаписьДанныхВМеткуRFID(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, СчитывательRFID, ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура RFID_ЗаписатьВМеткуGTINSerial(Команда)
	
	Если Не ЗначениеЗаполнено(СчитывательRFID) Тогда
		ТекстСообщения = НСтр("ru='Не выбран считыватель RFID.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ТекущаяСрока = Элементы.МеткиRFID.ТекущиеДанные;
	Если ТекущаяСрока <> Неопределено Тогда
		МодульОборудованиеСчитывательRFIDКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеСчитывательRFIDКлиент");
		ПараметрыЗаписи = МодульОборудованиеСчитывательRFIDКлиент.ПараметрыЗаписиМеткиRFID();
		ПараметрыЗаписи.TID = СокрЛП(ТекущаяСрока.TID);
		ПараметрыЗаписи.EPC = СокрЛП(ТекущаяСрока.EPC);
		ПараметрыЗаписи.БанкПамяти = "EPC";
		ПараметрыЗаписи.Данные = МенеджерОборудованияКлиентСервер.СформироватьДанныеSGTIN96(СокрЛП(ТекущаяСрока.GTIN), СокрЛП(ТекущаяСрока.СерийныйНомер));
		ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("RFID_ОперацияЗавершение", ЭтотОбъект);
		МодульОборудованиеСчитывательRFIDКлиент.НачатьЗаписьДанныхВМеткуRFID(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, СчитывательRFID, ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура RFID_ЗаписатьВМеткуUserMemory(Команда)
	
	Если Не ЗначениеЗаполнено(СчитывательRFID) Тогда
		ТекстСообщения = НСтр("ru='Не выбран считыватель RFID.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ТекущаяСрока = Элементы.МеткиRFID.ТекущиеДанные;
	Если ТекущаяСрока <> Неопределено Тогда
		МодульОборудованиеСчитывательRFIDКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеСчитывательRFIDКлиент");
		ПараметрыЗаписи = МодульОборудованиеСчитывательRFIDКлиент.ПараметрыЗаписиМеткиRFID();
		ПараметрыЗаписи.TID = ТекущаяСрока.TID;
		ПараметрыЗаписи.EPC = ТекущаяСрока.EPC;
		ПараметрыЗаписи.БанкПамяти = "USER";
		ПараметрыЗаписи.Данные = МенеджерОборудованияКлиентСервер.ПреобразоватьСтрокуВHEX(ТекущаяСрока.UserMemory);
		ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("RFID_ОперацияЗавершение", ЭтотОбъект);
		МодульОборудованиеСчитывательRFIDКлиент.НачатьЗаписьДанныхВМеткуRFID(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, СчитывательRFID, ПараметрыЗаписи);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура RFID_ГенерироватьСерийныйНомер(Команда)
	
	ТекущаяСрока = Элементы.МеткиRFID.ТекущиеДанные;
	Если ТекущаяСрока <> Неопределено Тогда
		TID = ТекущаяСрока.TID;
		EPC = ТекущаяСрока.EPC;
		
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПолучитьСерийныйНомерПоTID(TID, EPC);
		Если РезультатВыполнения.Результат Тогда
			ТекущаяСрока.СерийныйНомер = Формат(РезультатВыполнения.СерийныйНомер, "ЧВН=; ЧГ=");
		Иначе
			ОбщегоНазначенияБПОКлиент.СообщитьПользователю(РезультатВыполнения.ОписаниеОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура RFID_ГенерироватьВнешнееСобытие(Команда)
	
	Если Не ЗначениеЗаполнено(СчитывательRFID) Тогда
		ТекстСообщения = НСтр("ru='Не выбрано устройсво.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;                   
	
	ПараметрыОперации = Новый Структура();
	ПараметрыОперации.Вставить("ДанныеСобытия", "");
	ПараметрыОперации.Вставить("Base64", Ложь);
	
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("RFID_ОперацияЗавершение", ЭтотОбъект);
	МодульОборудованиеСчитывательRFIDКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеСчитывательRFIDКлиент");
	МодульОборудованиеСчитывательRFIDКлиент.ГенерироватьВнешнееСобытие(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, СчитывательRFID, ПараметрыОперации);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормыПринтерЭтикеток

&НаСервере
Функция ПолучитьРезультатВыполненияЗапроса(СКД)
	
	МассивНоменклатуры = Новый Массив;
	МассивНоменклатуры.Добавить(НоменклатураДляПечатиЭтикетки);
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
    Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
	Компоновщик.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	
	Настройки = Компоновщик.Настройки;
	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МассивНоменклатуры"));
	Параметр.Значение = МассивНоменклатуры;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ПКД = Новый ПроцессорКомпоновкиДанных;
    ПКД.Инициализировать(КомпоновщикМакета.Выполнить(СКД, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")));
	
	ТЗ = Новый ТаблицаЗначений;
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ПроцессорВывода.УстановитьОбъект(ТЗ);
    ПроцессорВывода.Вывести(ПКД);

    Возврат ТЗ;
	
КонецФункции

&НаСервере
Функция СформироватьДанныеДляПечати()
	
	СхемаКомпоновкиДанных = Справочники._ДемоЭтикеткиИЦенники.ПолучитьМакет("ПоляШаблонаЭтикетки");
	АдресХранилищаСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	СКД = ПолучитьИзВременногоХранилища(АдресХранилищаСКД);
	РезультатВыполненияЗапроса = ПолучитьРезультатВыполненияЗапроса(СКД);
	
	Поля = Новый Массив;
	
	Если РезультатВыполненияЗапроса.Количество()>0 Тогда
		Источник = РезультатВыполненияЗапроса[0];
		Для Каждого ТекПоле Из Этикетка.Поля Цикл
			Если ТекПоле.ТипЗаполнения = "Parameter" Тогда
				НовоеПоле = Новый Структура;
				НовоеПоле.Вставить("ИмяПоля", ТекПоле.Наименование);
				
				Попытка
					Значение = Вычислить("Источник." + ТекПоле.Значение);
				Исключение
					Значение = "";
				КонецПопытки;
				
				Если ТипЗнч(Значение) = Тип("ХранилищеЗначения") Тогда
					Значение = Значение.Получить();
					Если ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
						Значение = Base64Строка(Значение);
					Иначе
						Значение = Строка(Значение);
					КонецЕсли;
				КонецЕсли;
				Если ЗначениеЗаполнено(Значение) Тогда
					НовоеПоле.Вставить("Значение", Значение);
				Иначе
					Если ЗначениеЗаполнено(ТекПоле.ЗначениеПоУмолчанию) Тогда
						НовоеПоле.Вставить("Значение", ТекПоле.ЗначениеПоУмолчанию);
					Иначе
						НовоеПоле.Вставить("Значение", "");
					КонецЕсли;
				КонецЕсли;
				Поля.Добавить(НовоеПоле);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	МассивЭтикеток = Новый Массив;
	НоваяЭтикетка = Новый Структура;
	НоваяЭтикетка.Вставить("Количество", 1);
	НоваяЭтикетка.Вставить("Поля", Поля);
	МассивЭтикеток.Добавить(НоваяЭтикетка);
	
	Возврат Новый Структура("МассивЭтикеток, XMLОписаниеМакета", МассивЭтикеток, Этикетка.XMLОписаниеМакета);
	
КонецФункции

&НаКлиенте
Процедура ПЭ_ПечатьЗавершение(РезультатПечати, ДополнительныеПараметры) Экспорт
	
	Если РезультатПечати.Результат Тогда
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(НСтр("ru='Печать завершена.'"));
	Иначе
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(РезультатПечати.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПЭ_Печать(Команда)
	
	ДанныеЗаполнены = Истина;
	
	Если Не ЗначениеЗаполнено(Этикетка) Тогда
		ТекстСообщения = НСтр("ru='Не выбрана этикетка для печати.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		ДанныеЗаполнены = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НоменклатураДляПечатиЭтикетки) Тогда
		ТекстСообщения = НСтр("ru='Не выбрана номенклатура для печати этикетки.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		ДанныеЗаполнены = Ложь;
	КонецЕсли;
	
	Если ДанныеЗаполнены Тогда
	
		ДанныеДляПечати = СформироватьДанныеДляПечати();
		
		МодульОборудованиеПринтерыЭтикетокКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеПринтерыЭтикетокКлиент");
		ПараметрыОперации = МодульОборудованиеПринтерыЭтикетокКлиент.ПараметрыОперацииПечатиЭтикеток();
		ПараметрыОперации.ОписаниеЭтикеткиВXML = ДанныеДляПечати.XMLОписаниеМакета; 
		ПараметрыОперации.ДанныеДляПечати = ДанныеДляПечати.МассивЭтикеток;
		
		ОписаниеОповещениеПриЗавершенииПечати = Новый ОписаниеОповещения("ПЭ_ПечатьЗавершение", ЭтотОбъект);
		МодульОборудованиеПринтерыЭтикетокКлиент.НачатьПечатьЭтикеток(ОписаниеОповещениеПриЗавершенииПечати, УникальныйИдентификатор, ПринтерЭтикеток, ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПЭ_Инициализация(Команда)
	
	Если ПринтерЭтикеток.Пустая() Тогда
		ТекстСообщения = НСтр("ru='Принтер печати этикеток не выбран.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещениеПриЗавершенииПечати = Новый ОписаниеОповещения("ПЭ_ПечатьЗавершение", ЭтотОбъект);
	МодульОборудованиеПринтерыЭтикетокКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеПринтерыЭтикетокКлиент");
	МодульОборудованиеПринтерыЭтикетокКлиент.НачатьИнициализацияПринтераЭтикеток(ОписаниеОповещениеПриЗавершенииПечати, УникальныйИдентификатор, ПринтерЭтикеток);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УВ_РазобратьШтрихкод(Команда)
	
	ВремДанныеСканера = СтрЗаменить(ДанныеСканера, "\u001d", ОбщегоНазначенияБПОКлиентСервер.РазделительGS1());
	ПолученШтрихкод(ВремДанныеСканера);
	
КонецПроцедуры

&НаКлиенте
Процедура УВ_ВыборКодаВидаНоменклатурнойКлассификации(Команда)
	
	ОповещениеПриВыборе = Новый ОписаниеОповещения("УВ_ВыборКодаВидаНоменклатурнойКлассификации_Завершение", ЭтотОбъект);                                 
	МенеджерОборудованияКлиент.НачатьВыборКодаВидаНоменклатурнойКлассификации(ОповещениеПриВыборе);
	
КонецПроцедуры

&НаКлиенте
Процедура УВ_ВыборКодаВидаНоменклатурнойКлассификации_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		 ДанныеСканера = Результат.КодВидаНоменклатурнойКлассификации;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УВ_ГенерироватьВнешнееСобытие(Команда)
		
	Если Не ЗначениеЗаполнено(СканерШК) Тогда
		ТекстСообщения = НСтр("ru='Не выбрано устройсво.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;                   

	ПараметрыОперации = Новый Структура();
	ПараметрыОперации.Вставить("ДанныеСобытия", "0104680029460908215(TP%vWRq?,ha93Peys");
	ПараметрыОперации.Вставить("Base64", Ложь);
	
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("RFID_ОперацияЗавершение", ЭтотОбъект);
	МодульОборудованиеУстройстваВводаКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеУстройстваВводаКлиент");
	МодульОборудованиеУстройстваВводаКлиент.ГенерироватьВнешнееСобытие(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, СканерШК, ПараметрыОперации);

КонецПроцедуры

&НаКлиенте         
Процедура Преобразовать(Команда)
	
	МаркировкаРеквизитКодаТовараHEX = Base64Значение(МаркировкаРеквизитКодаТовараBASE64); // Декодируем строку
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКодТовараДляDataMatrixGS1(Команда)
	
	МодульМенеджерОборудованияМаркировкаКлиентСервер = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("МенеджерОборудованияМаркировкаКлиентСервер");
	ДанныеМаркировки = МодульМенеджерОборудованияМаркировкаКлиентСервер.СформироватьКодТовараДляDataMatrixGS1(МаркировкаGTIN, МаркировкаСерийныйНомер);
	МаркировкаРеквизитКодаТовараBASE64 = ДанныеМаркировки.РеквизитКодаТовара;
	МаркировкаРеквизитКодаТовараHEX = ДанныеМаркировки.РеквизитКодаТовараHEX;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинкуВыборФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Карт = Новый Картинка(ВыбранныеФайлы[0]);
		КартинкаBase64 = Base64Строка(Карт.ПолучитьДвоичныеДанные());
		КартинкаBase64 = СтрЗаменить(КартинкаBase64, Символы.ПС, "");
		КартинкаBase64 = СтрЗаменить(КартинкаBase64, Символы.ВК, "");
		ЛоготипКартинка = ПоместитьВоВременноеХранилище(Карт);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинку(Команда)
	
	Обработчик = Новый ОписаниеОповещения("ЗагрузитьКартинкуВыборФайла", ЭтотОбъект);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выбор файла картинки";
	Диалог.Фильтр = "PNG (*.png)|*.png|SVG (*.svg)|*.svg";
	Диалог.ИндексФильтра = 0;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Показать(Обработчик);
	
КонецПроцедуры      

&НаКлиенте
Процедура ЗагрузитьКартинкуВесыВыборФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ТекущаяСрока = Элементы.ТаблицаТоваровВесовСПечатьюЭтикеток.ТекущиеДанные;
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Карт = Новый Картинка(ВыбранныеФайлы[0]);
		КартинкаBase64 = Base64Строка(Карт.ПолучитьДвоичныеДанные());
		КартинкаBase64 = СтрЗаменить(КартинкаBase64, Символы.ПС, "");
		КартинкаBase64 = СтрЗаменить(КартинкаBase64, Символы.ВК, "");   
		ТекущаяСрока.КартинкаBase64 = КартинкаBase64;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинкуВесы(Команда)
	
	ТекущаяСрока = Элементы.ТаблицаТоваровВесовСПечатьюЭтикеток.ТекущиеДанные;
	Если ТекущаяСрока <> Неопределено Тогда
		Обработчик = Новый ОписаниеОповещения("ЗагрузитьКартинкуВесыВыборФайла", ЭтотОбъект);
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок = "Выбор файла картинки PNG";
		Диалог.Фильтр = "PNG (*.png)|*.png";
		Диалог.ИндексФильтра = 0;
		Диалог.МножественныйВыбор = Ложь;
		Диалог.Показать(Обработчик);   
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
